akshan-bansal/FRM-Claude/firmware/tradecard/sdkconfig.defaults
# TradeCard defaults. Target ESP32-S3 with 8MB flash + PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# libsodium provides Ed25519 sign/verify. Enable it as a managed component
# via idf_component.yml or the ESP-IDF Component Registry:
#   idf.py add-dependency "espressif/libsodium^1.0.20"

# Bigger main-task stack — cJSON + HTTPS + libsodium sign together push it.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# HTTP client with TLS. Set your CA bundle path if you terminate TLS at a
# tunnel (Cloudflare / Tailscale). For a loopback / LAN shim over plain HTTP
# these can stay defaulted.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
